Repository: jamesbrond/todoist-template
Catalog: locales/*/LC_MESSAGES/todoist_template.po
Languages: it

source: Please enter your API token:
it: Immettere il token per le API di Todoist

source: File mimetype %s
it: Tipo di file %s

source: YAML extension %s
it: Estensione YAML %s

source: JSON extension %s
it: Estensione JSON %s

source: CSV extension %s
it: Estensione CSV %s

source: use %s to load '%s' file
it: utilizzo %s per caricare il file '%s'

source: Something went wrong: undo all changes
it: Qualcosa è andato storto: butto via tutto

source: Project: %s%s (%s)
it: Progetto: %s%s (%s)

source: Section: %s%s (%s)
it: Sessione: %s%s (%s)

source: Task: %s%s (%s)
it: Attività: %s%s (%s)

source: Label: %s%s (%s)
it: Etichetta: %s%s (%s)

source: created new project: %s: %s
it: creato nuovo progetto: %s: %s

source: created new project: %s
it: creato nuovo progetto: %s

source: created new section: %s: %s
it: creata nuova sessione: %s: %s

source: created new section: %s
it: creata nuova sessione: %s

source: created new label: %s
it: creata nuova etichetta: %s

source: created new task: %s
it: creata nuova attività: %s

source: update task: %d
it: aggiornata attività: %d

source: Save rollback commands to %s
it: Salvataggio dei comandi di ripristino su %s

source: Load rollback commands from %s
it: Caricamento dei comandi di ripristino da %s

source: Failure
it: fallito

source: Rollback status: %s
it: Ripristino: %s

source: Success
it: completato

source: undo commands: %s
it: comandi di annullo: %s

source: undo response %s
it: risposta all'annullo %s

source: This script requires Python >= 3.8 and < 4
it: Questo script richiede Python >= 3.8 e < 4

source: Easily add tasks to Todoist with customizable YAML templates
it: Aggiungi facilmente atività a Todoist usando template personalizzabili

source: the placeholder values replaced in template
it: il valori dei simboli rimpiazzati nel template

source: keyring service name where store Todoist API Token
it: nome del servizio keyring dove leggere e archiviare il token per le API di Todoist

source: more verbose output
it: messaggi più prolissi

source: suppress output
it: nessun messaggio in uscita

source: allows the %(prog)s command to run a trial without making any changes on Todoist.com, this process has the same output as the real execution except for new object IDs.
it: lancia %(prog)s in modalità di prova senza fare alcuna modifica su Todoist.com, il processo produce la stessa messaggistica di una vera esecuzione ad eccezione per gli ID dei nuovi oggetti

source: loads undo file and rollbacks all operations in it
it: carica il file di annullamento e ripristina tutte le operazioni in esso

source: the Todoist authorization token
it: il token di autorizzazione per le API di Todoist

source: Todoist API token not found for %s application.
it: Il token per le API di Todoist non è stato trovato per l'applicazione %s

source: remove file %s
it: cancellazione del file %s

source: open file %s
it: apertura file %s

source: show program's version number and exit
it: mostra la versione del programma ed esce

source: usage:
it: utilizzo:

source: positional arguments
it: argomenti posizionali

source: options
it: opzioni

source: show this help message and exit
it: mostra questo messaggio di aiuto ed esce
